#### Terraform Format and Style 🖌 `failure` (ignored)
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.github.github_issue_label.channels will be created
  + resource "github_issue_label" "channels" {
      + color      = "0000FF"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "channels"
      + repository = "terraform"
      + url        = (known after apply)
    }

  # module.github.github_issue_label.discord will be created
  + resource "github_issue_label" "discord" {
      + color      = "0000FF"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "discord"
      + repository = "terraform"
      + url        = (known after apply)
    }

  # module.github.github_issue_label.discord_member will be created
  + resource "github_issue_label" "discord_member" {
      + color      = "0000FF"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "discord_member"
      + repository = "terraform"
      + url        = (known after apply)
    }

  # module.github.github_issue_label.discord_permissions will be created
  + resource "github_issue_label" "discord_permissions" {
      + color      = "0000FF"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "discord_permissions"
      + repository = "terraform"
      + url        = (known after apply)
    }

  # module.github.github_issue_label.discord_server will be created
  + resource "github_issue_label" "discord_server" {
      + color      = "0000FF"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "discord_server"
      + repository = "terraform"
      + url        = (known after apply)
    }

  # module.github.github_issue_label.github will be created
  + resource "github_issue_label" "github" {
      + color      = "0000FF"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "github"
      + repository = "terraform"
      + url        = (known after apply)
    }

  # module.github.github_issue_label.github_user will be created
  + resource "github_issue_label" "github_user" {
      + color      = "0000FF"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "github_user"
      + repository = "terraform"
      + url        = (known after apply)
    }

  # module.github.github_issue_label.invites will be created
  + resource "github_issue_label" "invites" {
      + color      = "0000FF"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "invites"
      + repository = "terraform"
      + url        = (known after apply)
    }

  # module.github.github_issue_label.modules will be created
  + resource "github_issue_label" "modules" {
      + color      = "0000FF"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "modules"
      + repository = "terraform"
      + url        = (known after apply)
    }

  # module.github.github_issue_label.repository will be created
  + resource "github_issue_label" "repository" {
      + color      = "0000FF"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "repository"
      + repository = "terraform"
      + url        = (known after apply)
    }

  # module.github.github_issue_label.roles will be created
  + resource "github_issue_label" "roles" {
      + color      = "0000FF"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "roles"
      + repository = "terraform"
      + url        = (known after apply)
    }

  # module.github.github_issue_label.teams will be created
  + resource "github_issue_label" "teams" {
      + color      = "0000FF"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "teams"
      + repository = "terraform"
      + url        = (known after apply)
    }

  # module.github.github_issue_label.variables will be created
  + resource "github_issue_label" "variables" {
      + color      = "0000FF"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "variables"
      + repository = "terraform"
      + url        = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```

</details>

*Pusher: @cesar-richard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*